"use strict";
//Часть 1:
function removeKeys(obj, arr){
    
    for(var i = 0; i < arr.length; i++) {
        var el = arr[i]; // el это повторяющийся ключ объекта в массиве, который мы потом удаляем.
        if(el in obj) {
            delete obj[el];
        }
    }
    return obj;
} 
// ========================================================================================= //
//Часть 2:

// ========================================================================================= //
//Часть 3:


// ========================================================================================= //
//Часть 4:

